
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>介绍 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="INSTALL.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="INSTALL.html">
            
                <a href="INSTALL.html">
            
                    
                    安装
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="DELELOPMENT/README.md">
            
                <span>
            
                    
                    开发
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="DEVELOPMENT/GUIDE.html">
            
                <a href="DEVELOPMENT/GUIDE.html">
            
                    
                    快速开始
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="DEVELOPMENT/LAYOUT.html">
            
                <a href="DEVELOPMENT/LAYOUT.html">
            
                    
                    动态布局(Layout)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="DEVELOPMENT/ROUTE.html">
            
                <a href="DEVELOPMENT/ROUTE.html">
            
                    
                    动态路由(Route)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="DEVELOPMENT/MODEL.html">
            
                <a href="DEVELOPMENT/MODEL.html">
            
                    
                    状态管理(Model)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="DEVELOPMENT/ENV.html">
            
                <a href="DEVELOPMENT/ENV.html">
            
                    
                    环境配置(Env)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="DEVELOPMENT/MOCK.html">
            
                <a href="DEVELOPMENT/MOCK.html">
            
                    
                    数据模拟(Mock)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.7" data-path="DEVELOPMENT/API.html">
            
                <a href="DEVELOPMENT/API.html">
            
                    
                    全局API
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="EDITOR/">
            
                <a href="EDITOR/">
            
                    
                    模版编辑器
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="EDITOR/DEVELOPMENT.html">
            
                <a href="EDITOR/DEVELOPMENT.html">
            
                    
                    编写代码模版
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="EDITOR/CUSTOM.html">
            
                <a href="EDITOR/CUSTOM.html">
            
                    
                    定制化编辑器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="EDITOR/TEMPLATE.html">
            
                <a href="EDITOR/TEMPLATE.html">
            
                    
                    现有模版代码
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="COMPONENT/">
            
                <a href="COMPONENT/">
            
                    
                    组件
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="COMPONENT/PAGE.html">
            
                <a href="COMPONENT/PAGE.html">
            
                    
                    页面(Page)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="COMPONENT/FILTER.html">
            
                <a href="COMPONENT/FILTER.html">
            
                    
                    筛选(Filter)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="COMPONENT/TABLE.html">
            
                <a href="COMPONENT/TABLE.html">
            
                    
                    表格(Table)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.4" data-path="COMPONENT/FORM.html">
            
                <a href="COMPONENT/FORM.html">
            
                    
                    表单(Form)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.5" data-path="COMPONENT/VIEW.html">
            
                <a href="COMPONENT/VIEW.html">
            
                    
                    查看(View)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.6" data-path="COMPONENT/TREE.html">
            
                <a href="COMPONENT/TREE.html">
            
                    
                    树形(Tree)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.7" data-path="COMPONENT/MODAL.html">
            
                <a href="COMPONENT/MODAL.html">
            
                    
                    弹窗(Modal)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.8" data-path="COMPONENT/ACTIONS.html">
            
                <a href="COMPONENT/ACTIONS.html">
            
                    
                    操作(Actions)
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >介绍</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4ECB;&#x7ECD;">&#x4ECB;&#x7ECD;</h1>
<h2 id="steer">Steer</h2>
<p>&#x4E00;&#x4E2A;&#x9002;&#x7528;&#x4E8E;&#x4E2D;&#x5927;&#x578B;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x6848;</p>
<p>Steer&#xFF0C; &#x610F;&#x601D;&#x662F;&#x638C;&#x8235;&#xFF0C;&#x5982;&#x679C;&#x628A;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x6BD4;&#x55BB;&#x4F5C;&#x6D77;&#x4E0A;&#x884C;&#x9A76;&#x7684;&#x8239;&#xFF0C;&#x90A3;&#x4E48;&#x63A7;&#x5236;&#x8239;&#x884C;&#x9A76;&#x65B9;&#x5411;&#x7684;&#x662F;&#x8239;&#x8235;&#xFF0C;&#x63A7;&#x5236;&#x597D;&#x4E86;&#x8239;&#x8235;&#xFF0C;&#x518D;&#x5927;&#x7684;&#x8239;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x63A7;&#x5236;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x63A7;&#x5236;&#x7684;&#x662F;&#x4EA4;&#x4E92;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x7EDF;&#x4E00;&#x7684;&#x89C4;&#x8303;&#xFF0C;&#x7EDF;&#x4E00;&#x7684;&#x98CE;&#x683C;&#xFF0C;&#x9010;&#x6E10;&#x6C89;&#x6DC0;&#x5C5E;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x98CE;&#x683C;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x8FD8;&#x6709;&#x53E6;&#x4E00;&#x4E2A;&#x613F;&#x666F;&#x662F;&#x968F;&#x7740;&#x7EC4;&#x4EF6;&#xFF0C;&#x6A21;&#x7248;&#x7684;&#x6C89;&#x6DC0;&#xFF0C;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x9010;&#x6B65;&#x51CF;&#x5C11;&#x91CD;&#x590D;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x9010;&#x6B65;&#x91CA;&#x653E;&#x51FA;&#x6765;&#xFF0C;&#x53BB;&#x505A;&#x66F4;&#x52A0;&#x6709;&#x6311;&#x6218;&#x6027;&#xFF0C;&#x6709;&#x610F;&#x4E49;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x91CA;&#x653E;&#x81EA;&#x5DF1;&#x7684;&#x521B;&#x9020;&#x529B;&#x3002;</p>
<p>&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x521D;&#x6B65;&#x60F3;&#x6CD5;&#x662F;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x5982;&#x4E0B;&#x51E0;&#x4EF6;&#x4E8B;&#xFF1A;</p>
<ol>
<li>&#x901A;&#x8FC7;&#x4E1A;&#x52A1;&#x68B3;&#x7406;&#xFF0C;&#x9010;&#x6B65;&#x6C89;&#x6DC0;&#x7EC4;&#x4EF6;&#xFF0C;&#x901A;&#x8FC7;&#x7EC4;&#x4EF6;&#x7684;&#x6C89;&#x6DC0;&#x8FBE;&#x5230;&#x5199;&#x9875;&#x9762;&#x4E0D;&#x5728;&#x9700;&#x8981;&#x6837;&#x5F0F;&#xFF0C;&#x53EA;&#x9700;&#x5173;&#x6CE8;&#x4E1A;&#x52A1;&#x903B;&#x8F91;</li>
<li>&#x5B9E;&#x73B0;&#x6A21;&#x7248;&#x7F16;&#x8F91;&#x5668;&#xFF0C;&#x5D4C;&#x5165;&#x5F53;&#x524D;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x652F;&#x6301;&#x6A21;&#x7248;&#x5B9E;&#x65F6;&#x9884;&#x89C8;&#x548C;&#x7F16;&#x8F91;</li>
<li>&#x68B3;&#x7406;&#x4E1A;&#x52A1;&#xFF0C;&#x6C89;&#x6DC0;&#x4E1A;&#x52A1;&#x4EE3;&#x7801;&#x6A21;&#x7248;&#xFF0C;&#x5B9E;&#x73B0;&#x4E00;&#x952E;&#x751F;&#x6210;&#x9875;&#x9762;&#x80FD;&#x529B;&#xFF0C;&#x968F;&#x7740;&#x4E0D;&#x65AD;&#x7684;&#x6C89;&#x6DC0;&#xFF0C;&#x5E03;&#x5C40;&#x7684;&#x65F6;&#x95F4;&#x4E5F;&#x7701;&#x53BB;&#x4E86;</li>
</ol>
<h2 id="&#x7EC4;&#x4EF6;">&#x7EC4;&#x4EF6;</h2>
<p> &#x8BE5;&#x9879;&#x76EE;&#x4E2D;&#x57FA;&#x4E8E;antd&#xFF0C;&#x8FDB;&#x884C;&#x4E8C;&#x6B21;&#x5C01;&#x88C5;&#x5B9E;&#x73B0;&#x4E86;&#x90E8;&#x5206;&#x6613;&#x7528;&#x5FEB;&#x6377;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x901A;&#x7528;&#x7684;&#x589E;&#x5220;&#x6539;&#x67E5;&#x9875;&#x9762;&#xFF0C;&#x9875;&#x9762;&#x5DF2;&#x7ECF;&#x65E0;&#x9700;&#x518D;&#x5173;&#x5FC3;&#x6837;&#x5F0F;&#xFF0C;&#x524D;&#x7AEF;&#x7684;&#x4EE3;&#x7801;&#x5F62;&#x5982;&#xFF1A;</p>
<pre><code class="lang-react">function Crud() {
  return (
    &lt;Page&gt;
      &lt;Page.Header
        title=&quot;&quot;
        actions={
          &lt;Actions&gt;
            &lt;Actions.Action type=&quot;text&quot;&gt;Text&lt;/Actions.Action&gt;
            &lt;Actions.Action type=&quot;link&quot;&gt;Link&lt;/Actions.Action&gt;
            &lt;Actions.Action&gt;&#x6B21;&#x6309;&#x94AE;&lt;/Actions.Action&gt;
            &lt;Actions.Action type=&quot;primary&quot;&gt;&#x4E3B;&#x6309;&#x94AE;&lt;/Actions.Action&gt;
          &lt;/Actions&gt;
        }
       &gt;
        &lt;Filter
          actions={
            &lt;Actions&gt;
              &lt;Actions.Action type=&quot;primary&quot;&gt;&#x521B;&#x5EFA;&lt;/Actions.Action&gt;
              &lt;Actions.Action&gt;&#x6309;&#x94AE;&lt;/Actions.Action&gt;
            &lt;/Actions&gt;
          }
         &gt;
          &lt;Filter.Item name=&quot;name&quot;&gt;&lt;Input /&gt;&lt;/Filter.Item&gt;
          &lt;Filter.Item name=&quot;date&quot;&gt;&lt;DatePicker.RangePicker /&gt;&lt;/Filter.Item&gt;
          &lt;Filter.Item name=&quot;gener&quot;&gt;&lt;Select /&gt;&lt;/Filter.Item&gt;
        &lt;/Filter&gt;
      &lt;/Page.Header&gt;
      &lt;Page.Sider&gt;
        &lt;!-- &#x4FA7;&#x8FB9;&#x680F; --&gt;
          &lt;Tree /&gt;
      &lt;/Page.Sider&gt;
      &lt;Table
          actions={
          &lt;Actions size=&quot;small&quot;&gt;
            &lt;Actions.Action&gt;&#x7F16;&#x8F91;&lt;/Actions.Action&gt;
            &lt;Actions.Action&gt;&#x67E5;&#x770B;&lt;/Actions.Action&gt;
            &lt;Actions.Action danger&gt;&#x5220;&#x9664;&lt;/Actions.Action&gt;
          &lt;/Actions&gt;
        }  
      &gt;
        &lt;Table.Column&gt;&lt;/Table.Column&gt;
        &lt;Table.Column&gt;&lt;/Table.Column&gt;
        &lt;Table.ColumnGroup&gt;
          &lt;Table.Column&gt;&lt;/Table.Column&gt;
            &lt;Table.Column&gt;&lt;/Table.Column&gt;
        &lt;/Table.ColumnGroup&gt;
      &lt;/Table&gt;
      &lt;!-- &#x5176;&#x4ED6;&#x9875;&#x9762;&#x5185;&#x5BB9; --&gt;
      &lt;Page.Footer&gt;&lt;/Page.Footer&gt;
    &lt;/Page&gt;
  )
}
</code></pre>
<p>&#x901A;&#x8FC7;&#x7EC4;&#x4EF6;&#x7684;&#x5C01;&#x88C5;&#xFF0C;&#x5B9E;&#x73B0;&#x9875;&#x9762;&#x5E03;&#x5C40;&#x53D8;&#x5F97;&#x5982;&#x6B64;&#x7B80;&#x5355;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x4E0A;&#x9762;&#x4E2D;&#x7684;&#x4EFB;&#x610F;&#x7EC4;&#x4EF6;&#x8282;&#x70B9;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x5C55;&#x793A;&#x65F6;&#x79FB;&#x9664;&#x5BF9;&#x5E94;&#x8282;&#x70B9;&#x5373;&#x53EF;&#xFF0C;&#x5982;&#xFF1A;Page.Footer&#xFF0C;Page.Header&#xFF0C;Page.Sider&#x6216;&#x8005;&#x662F;Actions</p>
<p>&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x7ED3;&#x6784;&#x662F;&#x7B26;&#x5408;&#x4EBA;&#x6027;&#x5316;&#x7684;&#xFF0C;&#x4EC5;&#x4EC5;&#x901A;&#x8FC7;&#x4EE3;&#x7801;&#xFF0C;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x77E5;&#x9053;&#xFF0C;&#x8FD9;&#x4E2A;&#x9875;&#x9762;&#x957F;&#x4EC0;&#x4E48;&#x6837;&#xFF0C;&#x5BF9;&#x4E8E;&#x754C;&#x9762;&#x5143;&#x7D20;&#x4E00;&#x76EE;&#x4E86;&#x7136;&#xFF0C;&#x5E76;&#x4E14;&#x5373;&#x4F7F;&#x662F;&#x4E0D;&#x540C;&#x6C34;&#x5E73;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x4F7F;&#x7528;&#x8FD9;&#x6837;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;&#x6700;&#x7EC8;&#x7684;&#x4EA4;&#x4E92;&#x5F62;&#x5F0F;&#x59CB;&#x7EC8;&#x4E00;&#x81F4;&#xFF0C;&#x5B83;&#x6700;&#x7EC8;&#x8F93;&#x51FA;&#x7684;&#x754C;&#x9762;&#x5982;&#x4E0B;:</p>
<p><img src="images/image-20200912200232409.png" alt="image-20200912200232409"></p>
<p>&#x672C;&#x9879;&#x76EE;&#x4E2D;&#x96C6;&#x6210;&#x4E86;&#x90E8;&#x5206;&#x5E38;&#x7528;&#x7EC4;&#x4EF6;&#xFF0C;&#x66F4;&#x591A;&#x8BE6;&#x60C5;&#x67E5;&#x770B;<a href="COMPONENT/">&#x7EC4;&#x4EF6;&#x6587;&#x6863;</a></p>
<h2 id="&#x6A21;&#x7248;">&#x6A21;&#x7248;</h2>
<p>&#x89E3;&#x51B3;&#x4E86;&#x5E03;&#x5C40;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x90A3;&#x4E9B;&#x4E0D;&#x65AD;&#x91CD;&#x590D;&#x7684;&#x901A;&#x7528;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5462;&#xFF0C;&#x5C31;&#x62FF;&#x4E0A;&#x9762;&#x7684;&#x589E;&#x5220;&#x6539;&#x67E5;&#x9875;&#x9762;&#x6765;&#x8BF4;&#xFF0C;&#x5E03;&#x5C40;&#x7EC4;&#x4EF6;&#x53EA;&#x662F;&#x89E3;&#x51B3;&#x4E86;&#x754C;&#x9762;&#x7684;&#x642D;&#x5EFA;&#xFF0C;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#x8FD8;&#x6709;&#x8BB8;&#x591A;&#x7684;&#x903B;&#x8F91;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x4E0D;&#x65AD;&#x7684;&#x7F16;&#x5199;&#xFF0C;&#x5982;&#x5B8C;&#x6574;&#x7684;&#x521B;&#x5EFA;&#x6D41;&#x7A0B;&#x5982;&#x4E0B;&#xFF0C;&#x70B9;&#x51FB;&#x521B;&#x5EFA;&#x6309;&#x94AE;&#xFF0C;&#x8F93;&#x5165;&#x8868;&#x5355;&#x503C;&#xFF0C;&#x63D0;&#x4EA4;&#x8868;&#x5355;&#xFF0C;&#x53D1;&#x8D77;&#x8BF7;&#x6C42;&#xFF0C;&#x5931;&#x8D25;&#x65F6;&#x63D0;&#x793A;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#xFF0C;&#x6210;&#x529F;&#x65F6;&#x63D0;&#x793A;&#x6210;&#x529F;&#x5E76;&#x5173;&#x95ED;&#x5F39;&#x7A97;&#x540C;&#x65F6;&#x5237;&#x65B0;&#x5217;&#x8868;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x6D41;&#x7A0B;&#x975E;&#x5E38;&#x7684;&#x591A;&#x5E76;&#x4E14;&#x91CD;&#x590D;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E0D;&#x65AD;&#x7684;&#x53BB;&#x5173;&#x6CE8;&#x548C;&#x7EC6;&#x5316;&#x5B83;</p>
<p>&#x7136;&#x800C;&#x901A;&#x8FC7;&#x6A21;&#x7248;&#x4EE3;&#x7801;&#x8FD9;&#x5C31;&#x53D8;&#x5F97;&#x7B80;&#x5355;&#xFF0C;&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x7684;&#x6A21;&#x7248;&#x53C2;&#x6570;&#x914D;&#x7F6E;&#xFF0C;&#x5373;&#x53EF;&#x4E00;&#x952E;&#x83B7;&#x53D6;&#x8FD9;&#x4E9B;&#x903B;&#x8F91;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#x53EA;&#x662F;&#x4E0D;&#x65AD;&#x63D0;&#x70BC;&#x8FD9;&#x4E9B;&#x903B;&#x8F91;&#xFF0C;&#x89C4;&#x8303;&#x5B83;&#xFF0C;&#x4F7F;&#x5176;&#x6E05;&#x6670;&#x6613;&#x61C2;&#xFF0C;&#x5F53;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x9875;&#x9762;&#x5B9E;&#x73B0;&#x6A21;&#x7248;&#x5316;&#x4E4B;&#x540E;&#xFF0C;&#x4EE3;&#x7801;&#x7684;&#x89C4;&#x8303;&#x6027;&#xFF0C;&#x4E00;&#x81F4;&#x6027;&#x5F97;&#x4EE5;&#x5B9E;&#x73B0;&#xFF0C;&#x6574;&#x4F53;&#x7684;&#x9879;&#x76EE;&#x53D8;&#x5F97;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x4EBA;&#x5199;&#x7684;&#x4E00;&#x6837;</p>
<p>&#x90A3;&#x4E48;&#x6A21;&#x7248;&#x4EE3;&#x7801;&#x505A;&#x4E0D;&#x4E86;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x540C;&#x4E00;&#x4E2A;&#x589E;&#x5220;&#x6539;&#x67E5;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x4E1A;&#x52A1;&#x4E2D;&#xFF0C;&#x4F1A;&#x5B58;&#x5728;&#x4E9B;&#x8BB8;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x6BD4;&#x5982;&#x8868;&#x5355;&#x9879;&#x9700;&#x8981;&#x90A3;&#x4E9B;&#x5B57;&#x6BB5;&#xFF0C;&#x8868;&#x683C;&#x663E;&#x793A;&#x54EA;&#x4E9B;&#x5B57;&#x6BB5;&#xFF0C;&#x4EE5;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x683C;&#x5F0F;&#x53BB;&#x505A;&#xFF0C;&#x867D;&#x7136;&#x8FD9;&#x4E9B;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7EC6;&#x5316;&#x6A21;&#x7248;&#x53C2;&#x6570;&#x6765;&#x8FBE;&#x5230;&#x7528;&#x6237;&#x53EF;&#x914D;&#x7F6E;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x4F46;&#x8FD9;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#xFF0C;&#x5BF9;&#x4E8E;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x8FD9;&#x6837;&#x4E13;&#x4E1A;&#x9886;&#x57DF;&#x6765;&#x8BF4;&#xFF0C;&#x754C;&#x9762;&#x7684;&#x7EC6;&#x5316;&#x914D;&#x7F6E;&#x8FDC;&#x4E0D;&#x5982;&#x76F4;&#x63A5;&#x5BF9;&#x4EE3;&#x7801;&#x7684;&#x7F16;&#x5199;&#xFF0C;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x6A21;&#x7248;&#x9700;&#x8981;&#x5B8C;&#x6210;&#x7684;&#x4EC5;&#x4EC5;&#x662F;&#x9875;&#x9762;&#x7684;&#x5E03;&#x5C40;&#x53CA;&#x8BE5;&#x573A;&#x666F;&#x4E0B;&#x901A;&#x7528;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF0C;&#x5982;&#x9875;&#x9762;&#x662F;&#x5426;&#x9700;&#x8981;&#x7B5B;&#x9009;&#xFF0C;&#x8868;&#x683C;&#x662F;&#x5426;&#x9700;&#x8981;&#x5206;&#x9875;&#xFF0C;&#x662F;&#x5426;&#x9700;&#x8981;<code>&#x589E;``&#x5220;``&#x6539;``&#x67E5;</code>&#x7B49;&#x52A8;&#x4F5C;&#x5373;&#x53EF;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x52A8;&#x4F5C;&#x4F1A;&#x5BF9;&#x5E94;&#x751F;&#x6210;&#x4E0D;&#x540C;&#x7684;&#x5F39;&#x7A97;&#x53CA;&#x4EA4;&#x4E92;&#x903B;&#x8F91;&#xFF0C;&#x7136;&#x800C;&#x5BF9;&#x4E8E;&#x8868;&#x683C;&#x8981;&#x663E;&#x793A;&#x54EA;&#x4E9B;&#x5217;&#xFF0C;&#x8868;&#x5355;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x54EA;&#x4E9B;&#x5B57;&#x6BB5;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x5728;&#x6A21;&#x7248;&#x4E2D;&#x5217;&#x51FA;&#x5927;&#x90E8;&#x5206;&#x7684;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x6A21;&#x5757;&#x5373;&#x53EF;&#xFF0C;&#x4E3A;&#x7684;&#x5C31;&#x662F;&#x5F00;&#x53D1;&#x8005;&#x53EF;&#x4EE5;&#x5728;&#x5C11;&#x67E5;&#x770B;&#x6216;&#x8005;&#x4E0D;&#x67E5;&#x770B;&#x6587;&#x6863;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5FEB;&#x901F;&#x627E;&#x5230;&#x4EE3;&#x7801;&#x53C2;&#x8003;&#xFF0C;&#x5B8C;&#x6210;&#x7EC6;&#x8282;&#x7684;&#x7F16;&#x5199;</p>
<p>&#x5BF9;&#x4E8E;&#x6A21;&#x7248;&#x7F16;&#x5199;&#x53CA;&#x6A21;&#x7248;&#x7F16;&#x8F91;&#x5668;&#x7684;&#x7F16;&#x5199;&#x67E5;&#x770B;<a href="EDITOR/">&#x6A21;&#x7248;&#x4EE3;&#x7801;&#x7F16;&#x8F91;&#x5668;&#x6587;&#x6863;</a></p>
<h2 id="&#x72B6;&#x6001;&#x7BA1;&#x7406;">&#x72B6;&#x6001;&#x7BA1;&#x7406;</h2>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x60F3;&#x8981;&#x7EDF;&#x4E00;&#x72B6;&#x6001;&#x7BA1;&#x7406;&#xFF0C;&#x4E3A;&#x4E86;&#x8BA9;&#x6211;&#x4EEC;&#x5728;&#x9875;&#x9762;&#x7EC4;&#x4EF6;&#x4E2D;&#x80FD;&#x4E00;&#x773C;&#x770B;&#x51FA;&#x6574;&#x4E2A;&#x9875;&#x9762;&#x5305;&#x542B;&#x4E86;&#x54EA;&#x4E9B;&#x7EC4;&#x4EF6;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x501F;&#x52A9;redux&#x7684;&#x72B6;&#x6001;&#x7BA1;&#x7406;&#xFF0C;&#x51CF;&#x5C11;&#x7EC4;&#x4EF6;&#x4E4B;&#x95F4;&#x7684;&#x72B6;&#x6001;&#x4F20;&#x9012;&#xFF0C;&#x540C;&#x65F6;&#x5229;&#x7528;zoro&#x4FBF;&#x6377;redux&#x5E93;&#x62BD;&#x79BB;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5230;&#x72EC;&#x7ACB;&#x7684;model&#x4E2D;&#xFF0C;&#x65B9;&#x4FBF;&#x6A21;&#x7248;&#x751F;&#x6210;&#x540E;&#x5FEB;&#x901F;&#x7684;&#x9488;&#x5BF9;&#x6027;&#x4FEE;&#x6539;</p>
<pre><code class="lang-react">import React, { useMemo } from &apos;react&apos;
import Page from &apos;@/components/page/page&apos;

import Filter from &apos;./components/filter/filter&apos;
import Tree from &apos;./components/tree/tree&apos;
import Create from &apos;./components/operator/create&apos;
import Edit from &apos;./components/operator/edit&apos;
import View from &apos;./components/operator/view&apos;
import Table from &apos;./components/table/table&apos;

export default function () {
  return useMemo(() =&gt; {
    return (
      &lt;Page&gt;
        &lt;Page.Sider&gt;
          &lt;Tree /&gt;
        &lt;/Page.Sider&gt;
        &lt;Filter /&gt;
        &lt;Table /&gt;
        &lt;Create /&gt;
        &lt;Edit /&gt;
        &lt;View /&gt;
      &lt;/Page&gt;
    )
  }, [])
}
</code></pre>
<p>&#x5982;&#x4E0A;&#x9762;&#x9875;&#x9762;&#x6240;&#x5C55;&#x793A;&#x7ED9;&#x6211;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x9875;&#x9762;&#x5305;&#x542B;&#x6811;&#x5F62;&#x7B5B;&#x9009;&#xFF0C;&#x7B5B;&#x9009;&#x5668;&#xFF0C;&#x8868;&#x683C;&#xFF0C;&#x521B;&#x5EFA;&#x5F39;&#x7A97;&#xFF0C;&#x7F16;&#x8F91;&#x5F39;&#x7A97;&#xFF0C;&#x67E5;&#x770B;&#x5F39;&#x7A97;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x903B;&#x8F91;&#x65F6;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x627E;&#x5230;&#x5BF9;&#x5E94;&#x7EC4;&#x4EF6;&#xFF0C;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x5373;&#x53EF;</p>
<p>&#x672C;&#x9879;&#x76EE;&#x96C6;&#x6210;&#x4E86;&#x6570;&#x636E;&#x72B6;&#x6001;&#x7BA1;&#x7406;&#x5E93;<a href="https://faurewu.github.io/zoro/" target="_blank">ZORO&#x4F7F;&#x7528;&#x6587;&#x6863;</a>&#xFF0C;&#x66F4;&#x591A;&#x5173;&#x4E8E;&#x72B6;&#x6001;&#x7BA1;&#x7406;&#x7684;&#x6587;&#x6863;&#x67E5;&#x770B;<a href="DEVELOPMENT/README.md">&#x5F00;&#x53D1;&#x6587;&#x6863;</a></p>
<p>&#x4E86;&#x89E3;&#x4E86;&#x9879;&#x76EE;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8FD8;&#x6709;&#x5174;&#x8DA3;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#x53CA;&#x4F7F;&#x7528;&#xFF0C;&#x7EE7;&#x7EED;&#x67E5;&#x770B;&#x4E0B;&#x9762;&#x7684;&#x6587;&#x6863;&#x5427;<a href="INSTALL.html">&#x5B89;&#x88C5;</a></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="INSTALL.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 安装">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"介绍","level":"1.1","depth":1,"next":{"title":"安装","level":"1.2","depth":1,"path":"INSTALL.md","ref":"INSTALL.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"README.md","mtime":"2020-09-12T16:19:00.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-09-13T14:06:19.565Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

